In [1]:
import pandas as pd

In [5]:
frame_data = {
    'name' : ['Ali','Ahmed','Waqar','Yawar'],
    'gender' : ['male','male','male','male'],
    'salary' : [15000,20000,17000,18000],
    'year'   : ['2010','2012','2104','2011'],
    
               }

In [8]:
data_frame = pd.DataFrame(frame_data)
data_frame

    name gender  salary  year
0    Ali   male   15000  2010
1  Ahmed   male   20000  2012
2  Waqar   male   17000  2104
3  Yawar   male   18000  2011

In [9]:
data_frame.loc[2]

name      Waqar
gender     male
salary    17000
year       2104
Name: 2, dtype: object

In [10]:
data_frame.name

0      Ali
1    Ahmed
2    Waqar
3    Yawar
Name: name, dtype: object

In [11]:
data_frame['salary']

0    15000
1    20000
2    17000
3    18000
Name: salary, dtype: int64

In [14]:
data_frame2 = pd.DataFrame(frame_data, columns = ['name','gender','salary','year','debt'])
data_frame2

    name gender  salary  year debt
0    Ali   male   15000  2010  NaN
1  Ahmed   male   20000  2012  NaN
2  Waqar   male   17000  2104  NaN
3  Yawar   male   18000  2011  NaN

In [15]:
data_frame2['debt'] = 14000

In [16]:
data_frame2

    name gender  salary  year   debt
0    Ali   male   15000  2010  14000
1  Ahmed   male   20000  2012  14000
2  Waqar   male   17000  2104  14000
3  Yawar   male   18000  2011  14000

In [17]:
series_to_insert = pd.Series(data = [15000,17000], index = [1,3])

In [19]:
data_frame2['debt'] = series_to_insert
data_frame2

    name gender  salary  year     debt
0    Ali   male   15000  2010      NaN
1  Ahmed   male   20000  2012  15000.0
2  Waqar   male   17000  2104      NaN
3  Yawar   male   18000  2011  17000.0

Assigning a column that doesn’t exist will create a new column but you cannot do it with a dot notation as
data_frame2.result

In [29]:
data_frame2['result'] = pd.Series(data = ['pass','fail','pass','fail'])
data_frame2

    name gender  salary     debt result
0    Ali   male   15000      NaN   pass
1  Ahmed   male   20000  15000.0   fail
2  Waqar   male   17000      NaN   pass
3  Yawar   male   18000  17000.0   fail

In [30]:
print(data_frame2['result'])
print(data_frame2.result)

0    pass
1    fail
2    pass
3    fail
Name: result, dtype: object
0    pass
1    fail
2    pass
3    fail
Name: result, dtype: object

The del method can then be used to remove this column

In [31]:
del data_frame2['result']
data_frame2

    name gender  salary     debt
0    Ali   male   15000      NaN
1  Ahmed   male   20000  15000.0
2  Waqar   male   17000      NaN
3  Yawar   male   18000  17000.0

In [32]:
data_frame2.columns

Index(['name', 'gender', 'salary', 'debt'], dtype='object')

# Dictionary of Dictionaries when passed to data frame

In [35]:
data = {
    'salary' : {2001: 15000, 2002:3000, 2003:40000},
    'bonus' : {2003 : 2000, 2001 : 3000, 2007 : 1000},
    
}
data_frame4 = pd.DataFrame(data)
data_frame4

       salary   bonus
2001  15000.0  3000.0
2002   3000.0     NaN
2003  40000.0  2000.0
2007      NaN  1000.0

In [36]:
data_frame4.T

           2001    2002     2003    2007
salary  15000.0  3000.0  40000.0     NaN
bonus    3000.0     NaN   2000.0  1000.0

In [37]:
data_frame4

       salary   bonus
2001  15000.0  3000.0
2002   3000.0     NaN
2003  40000.0  2000.0
2007      NaN  1000.0

In [39]:
data_frame4.columns.name = "pay_parameters"
data_frame4.index.name = "years"

In [40]:
data_frame4

pay_parameters   salary   bonus
years
2001            15000.0  3000.0
2002             3000.0     NaN
2003            40000.0  2000.0
2007                NaN  1000.0

In [41]:
data_frame4.loc[2008] = [12000,3000]

In [42]:
data_frame4

pay_parameters   salary   bonus
years
2001            15000.0  3000.0
2002             3000.0     NaN
2003            40000.0  2000.0
2007                NaN  1000.0
2008            12000.0  3000.0

In [43]:
data_frame4['increment'] = pd.Series(data = [1200,1300,1000,1400,1500], index = [2001,2002,2003,2007,2008])

In [44]:
data_frame4

pay_parameters   salary   bonus  increment
years
2001            15000.0  3000.0       1200
2002             3000.0     NaN       1300
2003            40000.0  2000.0       1000
2007                NaN  1000.0       1400
2008            12000.0  3000.0       1500

In [45]:
del data_frame4['increment']

In [46]:
data_frame4

pay_parameters   salary   bonus
years
2001            15000.0  3000.0
2002             3000.0     NaN
2003            40000.0  2000.0
2007                NaN  1000.0
2008            12000.0  3000.0

In [48]:
data_frame4.loc[2008]

pay_parameters
salary    12000.0
bonus      3000.0
Name: 2008, dtype: float64

In [54]:
data_frame4.drop(2002, axis = 0)

pay_parameters   salary   bonus
years
2001            15000.0  3000.0
2003            40000.0  2000.0
2007                NaN  1000.0
2008            12000.0  3000.0

In [55]:
data_frame4.drop('bonus', axis = 1)

pay_parameters   salary
years
2001            15000.0
2002             3000.0
2003            40000.0
2007                NaN
2008            12000.0